{"task": "ag_news", "input": "Article: Microsoft Corp. 2.0: a kinder corporate culture Even a genius can mess up. Bill Gates was a brilliant technologist when he cofounded Microsoft , but as he guided it to greatness in both size and historical consequence, he blundered. He terrorized underlings with his temper and parceled out praise like Scrooge gave to charity. Only the lash inspired the necessary aggressiveness to beat the competition, he thought.\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: The Real Time Modern Manila Blues: Bill Monroe Meets Muddy Waters in the Orient Globalization does strange things to people. A day in the life of a Manila Philippines based business consultant - proving that you really CAN talk about Muddy Walters, bluegrass and work all on the same page...\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Board Members, Executives and Family Members Can Still Benefit  Many of Corporate Washington's executives and board members have side deals with the companies they oversee.\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Cost Cuts Help Kmart Post Profit  CHICAGO (Reuters) - Kmart Holding Corp. &lt;KMRT.O&gt; on Monday  reported its third consecutive quarterly profit as cost cuts  made up for slumping sales, and its cash pile grew to about  \\$2.6 billion.\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Intelsat to Be Bought for \\$5 Billion  NEW YORK (Reuters) - Intelsat Ltd., the world's  second-largest satellite operator, said on Monday it agreed to  be bought by a consortium of four private equity firms for \\$5  billion, including assumption of \\$2 billion of debt.\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Customers of Telco Companies Face Privacy Breach A security advisory posted on Bugtraq demonstrates how hackers can compromise customers of T-mobile wireless and Verizon (landline) voicemail boxes. The advisory talks about the use of Caller-ID spoofing the customers number, allowing a bypass of the PIN code since the voicemail thinks that the customer is calling to check their own voicemail. According to Secure Science Corporation, there has been no response from the vendors. Comments have been posted that T-Mobile has optional PIN code protection off by default. Better turn it on. \nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Reverse Psychology \\\\I really hope SUN doesn't Open Source Java at JavaOne this year.  It would be a\\terrible decision and seriously hurt the tech industry.  Also, it would hurt SUN\\and I'm sure their responsible enough to realize this.\\\\(Lets hope that works!)\\\\\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: A Digital Doctor Treats Computer Contamination Unfortunately for users, computer equipment manufacturers and resellers don't adequately inform Windows users of the risks involved in accessing the Internet without proper security measures.&lt;br&gt;&lt;FONT face=\"verdana,MS Sans Serif,arial,helvetica\" size=\"-2\"\\ color=\"#666666\"&gt;&lt;B&gt;-The Washington Post&lt;/b&gt;&lt;/font&gt;\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Blog Interrupted The instant message blinked on the computer at Jessica Cutler's desk in the Russell Senate Office Building. \"Oh my God, you're famous.\"\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Taking the Microsoft Rorschach test CNET News.com's Charles Cooper asks what it is about Microsoft that pushes so many people straight over the edge?\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: US NBA players become the Nightmare Team after epic loss (AFP) AFP - Call them the \"Nightmare Team\".\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Report: Roenick Paid for Betting Tips (AP) AP - Flyers star Jeremy Roenick paid more than  #36;100,000 to a Florida firm that made millions selling betting tips to gamblers, law enforcement officials told The Philadelphia Inquirer.\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Full Disclosure Ordered The NFL told its coaches Monday that they must be more specific in reporting injuries to players, saying the current wording of the policy \"invites action that runs counter to our intent.\"\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Hall-of-Fame credentials HAVEN, Wis. -- An official from the World Golf Hall of Fame joined a casual conversation last year about players on the verge of election and someone mentioned Vijay Singh.  quot;He wouldn #39;t get my vote, quot; the official said. \nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: I #39;m innocent, says Greek Olympic champion Kenteris Olympic champion Kostas Kenteris, who is likely to be expelled from the Olympics for missing a doping test, said Tuesday that he is not a drugs cheat. \nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Italy on alert after purported Al-Qaeda ultimatum expires (AFP) AFP - Italy was on high alert as a group linked to Al-Qaeda reportedly threatened to attack, singling out Prime Minister Silvio Berlusconi as a target, after the expiry of a deadline for Rome to pull its troops out of Iraq.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: New U.N. Official Assumes Kosovo Control (AP) AP - The new U.N. administrator for Kosovo took control Sunday of the Serbian province, which has remained deeply divided along ethnic lines since the end of a 1999 war.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: U.N. Official Urges Political Independence (AP) AP - The United Nations should find ways to demonstrate political independence, regain the neutrality it lost after the Sept. 11 attacks and better communicate with the world's 1 billion Muslims, a top U.N. official said Monday.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: US to withdraw up to 70,000 troops from Europe and Asia: Bush (AFP) AFP - The United States will withdraw up to 70,000 troops from Europe and Asia over the next decade, President George W. Bush said, in a move aimed at increasing the capability to fight the \"war on terror\" and meet other new threats.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Iran Calls for U.N. Intervention in Iraq (AP) AP - Iran and Saudi Arabia called Monday for the United Nations to intervene in Iraq to stop the fighting between U.S. forces and Shhite militants hiding in the holy city of Najaf.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
