{"task": "ag_news", "input": "Article: Researchers seek to untangle the e-mail thread E-mail is a victim of its own success. That's the conclusion of IBM Corp. researchers in Cambridge, who have spent nearly a decade conducting field tests at IBM and other companies about how employees work and use electronic mail. It's clear to them that e-mail has become the Internet's killer application.\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Microsoft Corp. 2.0: a kinder corporate culture Even a genius can mess up. Bill Gates was a brilliant technologist when he cofounded Microsoft , but as he guided it to greatness in both size and historical consequence, he blundered. He terrorized underlings with his temper and parceled out praise like Scrooge gave to charity. Only the lash inspired the necessary aggressiveness to beat the competition, he thought.\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: The Real Time Modern Manila Blues: Bill Monroe Meets Muddy Waters in the Orient Globalization does strange things to people. A day in the life of a Manila Philippines based business consultant - proving that you really CAN talk about Muddy Walters, bluegrass and work all on the same page...\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: CompUSA Stores to Sell Gateway PCs (Reuters) Reuters - Gateway Inc. (GTW.N), the computer\\maker that recently shuttered its chain of 188 stores, will\\begin selling its desktops at CompUSA Inc.'s outlets later this\\week, the two companies said on Monday.\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: \\$1.1b deal to join hospital chains BRENTWOOD, Tenn. -- LifePoint Hospitals Inc. , an operator of acute care facilities in rural areas, outlined a deal yesterday to buy rival Province Healthcare Co. for about \\$1.1 billion in cash and stock.\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Customers of Telco Companies Face Privacy Breach A security advisory posted on Bugtraq demonstrates how hackers can compromise customers of T-mobile wireless and Verizon (landline) voicemail boxes. The advisory talks about the use of Caller-ID spoofing the customers number, allowing a bypass of the PIN code since the voicemail thinks that the customer is calling to check their own voicemail. According to Secure Science Corporation, there has been no response from the vendors. Comments have been posted that T-Mobile has optional PIN code protection off by default. Better turn it on. \nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Mozilla Exceptions (mexception) \\\\For some reason I never released this code.\\\\I developed it while working on NewsMonster and just forgot I think\\\\It's an extension for Mozilla that allows you to see all runtime exceptions\\(with full stack traces) that are unhandled by Mozilla. \\\\Just install it and if your code generates an unhandled exception it will show\\up in the logs and on the console.\\\\Very handy for doing any hardcore Mozilla development.\\\\\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: HP: The Adaptive Enterprise that can't adapt &lt;strong&gt;Opinion&lt;/strong&gt; SAP hardly to blame\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Study: IT workers more optimistic IT workers' confidence in the employment market kept growing in July, but techies are less happy with actual jobs than workers overall.\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Taking the Microsoft Rorschach test CNET News.com's Charles Cooper asks what it is about Microsoft that pushes so many people straight over the edge?\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: US NBA players become the Nightmare Team after epic loss (AFP) AFP - Call them the \"Nightmare Team\".\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Puerto Rico Upsets United States Men The United States men's basketball team lost to Puerto Rico, 92-73. The loss could put the American gold medal hopes in jeopardy.\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Full Disclosure Ordered The NFL told its coaches Monday that they must be more specific in reporting injuries to players, saying the current wording of the policy \"invites action that runs counter to our intent.\"\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Blue Jays hope to go places with Gibbons From Montana to Maine, Puerto Rico to Canada, John Gibbons tagged along wherever the military deemed his father should live. The constant travel gave him a taste of the nomadic life of a baseball manager, his future profession. It also gave him an accent all his own, a Texas twang inflected with tinges of New England.\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Iranian judo scandal Iran #39;s Judo champion, a favourite at the Athens Games, has disqualified himself rather than face an Israeli opponent, apparently on the instruction of Iran #39;s Olympic Committee. So far the International Olympic Committee has been silent. What #39;s your view? ...\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: South Ossetia ceasefire discussed Georgia and South Ossetia negotiate the details of a truce they forged, despite reports of a village attack.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: 'Mock executions' for UK hostage The British journalist who was kidnapped in Iraq says he faced mock executions and tried to escape his captors.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Iraq troops move angers S Koreans Clashes with riot police erupt as thousands protest in Seoul against plans to send troops to help US-led forces in Iraq.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Package prompts US embassy alert An unidentified substance  sent to the US embassy in the Malaysian capital Kuala Lumpur leads to a security scare. \nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Chvez Is Declared the Winner in Venezuela Referendum The president won the backing of 58 percent of voters, officials said, but the opposition said that the government had cheated.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
