{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Drinking in public in Denmark is legal in general. The law forbids ``disturbing of the public law and order''. Thus general consumption is accepted. Several cafes have outdoor serving in the same zones.\nQuestion: can you drink alcohol in public in denmark?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: As of 8 August 2016, the FDA extended its regulatory power to include e-cigarettes. Under this ruling the FDA will evaluate certain issues, including ingredients, product features and health risks, as well their appeal to minors and non-users. The FDA rule also bans access to minors. A photo ID is required to buy e-cigarettes, and their sale in all-ages vending machines is not permitted. The FDA in September 2016 has sent warning letters for unlawful underage sales to online retailers and retailers of e-cigarettes.\nQuestion: is vaping illegal if you are under 18?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The fifth and final season of Bates Motel premiered on February 20, 2017, and concluded on April 24, 2017. The season consisted of 10 episodes and aired on Mondays at 10 p.m. ET/PT on A&E. The series itself is described as a ``contemporary prequel'' to the 1960 film Psycho, following the life of Norman Bates and his mother Norma prior to the events portrayed in the Hitchcock film. However, the final season of the series loosely adapts the plot of Psycho. The series takes place in the fictional town of White Pine Bay, Oregon.\nQuestion: is there going to be a season 5 of bates motel?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Phone hacking, being a form of surveillance, is illegal in many countries unless it is carried out as lawful interception by a government agency. In the News International phone hacking scandal, private investigator Glenn Mulcaire was found to have violated the Regulation of Investigatory Powers Act 2000. He was sentenced to six months in prison in January 2007. Renewed controversy over the phone hacking claims led to the closure of the News of the World in July 2011.\nQuestion: is it illegal to hack into someones phone?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Taxation in Puerto Rico takes the form of both Federal and Commonwealth taxes. Puerto Rico has independent tax-levying authority by provisions of 48 U.S.C. § 734 of the United States code.\nQuestion: do citizens in puerto rico pay us taxes?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: If the player throws a Yahtzee and has already filled the Yahtzee box with a score of 50, they score a Yahtzee bonus and get an extra 100 points. However, if they throw a Yahtzee and have filled the Yahtzee category with a score of 0, they do not get a Yahtzee bonus.\nQuestion: can you get 2 yahtzees in a game?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Fairmont Hotels & Resorts is a chain of luxury hotels owned by AccorHotels since 2016. Fairmont Hotels & Resorts was created in 2001 following the merger of Canadian Pacific Hotels (founded in the late 1880s) and Fairmont Hotels (founded in 1907). Fairmont operates 75 properties in 24 countries, with a strong presence in the United States, and Canada.\nQuestion: is the fairmont hotel part of a chain?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The soundtrack album was released on June 15, 2018. In addition to the film's score, it includes the vocalized theme songs for Mr. Incredible, Frozone, and Elastigirl heard in the credits, as well as bonus versions of the songs sung by Disney's a cappella group, DCappella, and the latter's version of the track ``The Glory Days'' from the first film.\nQuestion: is there ending credits for the incredibles 2?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Entry into Canada is solely determined by Canada Border Services Agency (CBSA) officials in accordance with Canadian law. Visitors are required to have the necessary travel documentation and be in good health. If asked, they must satisfy an immigration officer of ties to their country of origin, such as a job, home, and family. They must also satisfy the officer that they will leave Canada at the end of their visit. Additionally, they must have sufficient money for their stay, and all items belonging to an individual, including the vehicle the individual may be traveling in, are subject to search by the CBSA.\nQuestion: does it cost money to get into canada?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: When a person is called for jury duty in the United States, that service is mandatory and the person summoned for jury duty must attend. Failing to report for jury duty is illegal and usually results in an individual simply being placed back into the selection pool in addition to potential criminal prosecution. Repeatedly ignoring a jury summons without explanation will result in strict penalties, which may include being fined or a bench warrant issued for contempt of court. Employers are not allowed to fire an employee for being called to jury duty, but they are typically not required to pay salaries during this time. When attended, potential jurors may be asked to serve as a juror in a trial, or they may be dismissed.\nQuestion: is it illegal to not do jury duty?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The home field curse affects the host team of the Super Bowl. So far no team has yet managed to reach the Super Bowl in their home stadium. Four teams with Super Bowls in their home venue have qualified for the divisional playoffs: the 1994 Miami Dolphins, the 1998 Miami Dolphins, the 2016 Houston Texans, and the 2017 Minnesota Vikings, the Vikings being the first to qualify for their conference's title game. From 1966--2011 (excluding the six Super Bowl games held in a stadium without a professional team), the Super Bowl host team has had 11 winning seasons, four split seasons, and 25 losing seasons. Mathematically, the probability of that many losing seasons or more occurring by chance (assuming a 50 percent chance of having a losing season (disregarding .500 seasons)) is 7.69 percent. It should be noted, however, that the Super Bowl host stadium is selected several years before the game is played, without regard to the teams that qualify.\nQuestion: has any nfl team played the superbowl at home?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The return address is not required on postal mail. However, lack of a return address prevents the postal service from being able to return the item if it proves undeliverable; such as from damage, postage due, or invalid destination. Such mail may otherwise become dead letter mail.\nQuestion: do you need to put return address on mail?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Susan slips away from the talent show and puts the plan into motion. As she is about to pull the trigger, however, she realizes that Henry's plan, though ingenious, is the construct of a child, and that she must act as an adult. She immediately confronts Glenn and tells him that she is going to expose him for what he has done to Christina. Glenn replies that everyone will believe him, not her, and he tells her that he is going to call his police chief to come and bring her in. At the same time, affected by Christina's dance performance at the talent show, Principal Wilder decides to follow through on the abuse accusation and contacts the authorities. Glenn returns home, calls his relative at Social Services, and learns that an investigation is being opened into his abuse of Christina. As the police arrive at his house, Glenn kills himself. Susan legally adopts Christina as her daughter. She also finishes writing one of her children's books, as Henry had urged her to do.\nQuestion: does christina die in the book of henry?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: So far no team has yet managed to reach the championship game in their home stadium, or even come close. Only two NFL teams have reached the Super Bowl hosted in their home market: the San Francisco 49ers, who played Super Bowl XIX in Stanford Stadium, rather than Candlestick Park, and the Los Angeles Rams, who played Super Bowl XIV in the Rose Bowl, rather than the Los Angeles Memorial Coliseum. Besides those two, the only other Super Bowl venue that was not the home stadium to an NFL team at the time was Rice Stadium in Houston: the Houston Oilers had played there previously, but moved to the Astrodome several years prior to Super Bowl VIII. The Miami Orange Bowl was the only AFL stadium to host a Super Bowl and the only stadium to host consecutive Super Bowls, hosting Super Bowl II and III. MetLife Stadium, which hosted Super Bowl XLVIII, is the home stadium of two NFL teams: the New York Giants and the New York Jets.\nQuestion: has any team won the superbowl in their own stadium?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The State neither issues nor requires a permit to carry a weapon on one's person, openly or concealed. This is known in the U.S. as constitutional carry, since one's ``permit'' is the United States Constitution. Vermont is the only state where this has always been the case (hence the alternative term Vermont carry). Vermont law does not distinguish between residents and non-residents of the state; both have the same right to carry permit-free while in Vermont.\nQuestion: do you need a gun permit in vermont?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The purpose of not counting a sacrifice fly as an at-bat is to avoid penalizing hitters for a successful action. The sacrifice fly is one of two instances in baseball where a batter is not charged with a time at bat after putting a ball in play; the other is the sacrifice hit (also known as a sacrifice bunt). But, while a sacrifice fly doesn't affect a player's batting average, it counts as a plate appearance, thus lowering his on-base percentage, and a player on a hitting streak will have the hit streak end if he has no official at-bats but has a sacrifice fly.\nQuestion: does a sac fly count against your batting average?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Since 22 February 2017, New Hampshire is a constitutional carry state, requiring no license to open carry or concealed carry a firearm in public. Concealed carry permits are still issued for purposes of reciprocity with other states.\nQuestion: do i need a concealed carry permit in nh?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: ``Stop and identify'' statutes are statutory laws in the United States that authorize police to legally obtain the identification of someone whom they reasonably suspect of having committed a crime. If there is no reasonable suspicion that a crime has been committed, is being committed, or is about to be committed, an individual is not required to provide identification, even in ``Stop and ID'' states.\nQuestion: do i need to provide id to police?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: When a traffic stop is made, a warning issued by the officer is a statement that the motorist has committed some offense, but is being spared the actual citation. Officers use their own discretion whether to issue a citation or warning. The motorist may receive the warning either verbally or written, but will not be charged with the offense, will not have to pay a fine, and will not receive any points. Depending on the laws of the jurisdiction, the warning may or may not appear on records visible to officers, which, if it does, could result in another stop within a fixed period of time leading to an actual citation, or in some cases, the motorist may be charged with both offenses.\nQuestion: do you have to pay for a warning ticket?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Lake Tahoe never freezes. Since 1970, it has mixed to a depth of at least 1,300 ft (400 m) a total of 6 or 7 times. Dissolved oxygen is relatively high from top to bottom. Analysis of the temperature records in Lake Tahoe has shown that the lake warmed (between 1969 and 2002) at an average rate of 0.015 °C per year. The warming is caused primarily by increasing air temperatures, and secondarily by increasing downward long-wave radiation. The warming trend is reducing the frequency of deep mixing in the lake, and may have important effects on water clarity and nutrient cycling.\nQuestion: does lake tahoe freeze over in the winter?", "output": "no", "options": ["no", "yes"]}
