{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Washington has a 6.50% statewide sales tax. Local rates vary based on an individual's location at the point of purchase and can total up to 3.10% for a combined rate of 9.60%. In addition, due to the large number of Native American sovereign nations located within the state, sales-tax rates, if any, can vary based on state treaties with each nation.\nQuestion: is there sales tax in the state of washington?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: As of 8 August 2016, the FDA extended its regulatory power to include e-cigarettes. Under this ruling the FDA will evaluate certain issues, including ingredients, product features and health risks, as well their appeal to minors and non-users. The FDA rule also bans access to minors. A photo ID is required to buy e-cigarettes, and their sale in all-ages vending machines is not permitted. The FDA in September 2016 has sent warning letters for unlawful underage sales to online retailers and retailers of e-cigarettes.\nQuestion: is vaping illegal if you are under 18?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: An unopened bottle of Coffee-Mate can last up to two years with no refrigeration and can stay fresh for two weeks once it is opened. The product is popular in offices where refrigeration may not be available. Non-dairy creamer can be used by individuals who are lactose-intolerant. Once opened, liquid non-dairy creamer should be refrigerated.\nQuestion: does liquid coffee mate have to be refrigerated?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Toll-free numbers in the North American Numbering Plan (NANP) are commonly called ``800 numbers'' after the original area code which was used to dial them. They include the area code 800 (since January 1, 1966), 888 (since March 1, 1996), 877 (since April 4, 1998), 866 (since July 29, 2000), 855 (since October 9, 2010), 844 (since December 7, 2013), and 833 (since April 22, 2017). Area codes reserved for future expansion include 822, 880 through 887, and 889.\nQuestion: is a 1-888 number toll free?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Since 22 February 2017, New Hampshire is a constitutional carry state, requiring no license to open carry or concealed carry a firearm in public. Concealed carry permits are still issued for purposes of reciprocity with other states.\nQuestion: is it legal to carry a gun in new hampshire?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The return address is not required on postal mail. However, lack of a return address prevents the postal service from being able to return the item if it proves undeliverable; such as from damage, postage due, or invalid destination. Such mail may otherwise become dead letter mail.\nQuestion: can you send an envelope without a return address?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: In People v. La Voie, Supreme Court of Colorado, 395 P.2d 1001 (1964), The court wrote, ``When a person has reasonable grounds for believing, and does in fact actually believe, that danger of his being killed, or of receiving great bodily harm, is imminent, he may act on such appearances and defend himself, even to the extent of taking human life when necessary, although it may turn out that the appearances were false, or although he may have been mistaken as to the extent of the real actual danger.''\nQuestion: do i have the right to protect myself?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Beginning November 1, 2011, it is legal to load a handgun, or to transport a loaded handgun cased or uncased, in a vehicle without a license. NOTE: This does NOT apply to long guns; they still must be unloaded, but now may be uncased. There is still some confusion as to whether or not an encased gun is concealed, so if it is cased, best practice is to keep the long gun out of reach. Long guns must be ``discernable to ordinary observation'', since a conceal carry license does not apply. Previously all firearms had to be unloaded & encased (per the transport statute), & out of reach (derived from the concealed carry statute). Those with a concealed carry license may conceal a pistol in a vehicle.\nQuestion: can i carry my gun in my car in wisconsin?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Under federal law, airsoft guns are not classified as firearms and are legal for all ages. People under the age of 18 are not permitted to buy airsoft guns over the counter in stores. However, a person of any age may use one (with the permission of their parents, of course, for anyone under 18). This is also the case for the laws in each state. However, in some major cities, the definition of a firearm within their respected ordinances includes propulsion by spring or compressed air, thus making airsoft subject to applicable laws. For example, airsoft guns within the state of California can only be bought by a person above the age of 18. However, no laws indicate an age requirement to sell airsoft guns. Generally speaking, toy, look-alike, and imitation firearms must have an orange tip during shipping and transportation.\nQuestion: do you have to be 18 to buy airsoft guns?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Missouri has no specific state limitations on the places where alcohol may be sold ``off-premises'' (i.e. for consumption elsewhere). As a result, Missouri is famous in the region for grocery stores, drug stores, and even gas stations throughout the state which sell a wide variety of beer, wine, and liquor. As long as it is not located within 100 feet (30 m) of a school or church, virtually any retail business (including a vague and undefined ``general merchandise store'') which obtains the proper licenses from the Division of Alcohol and Tobacco Control and local authorities may sell any type of alcohol. State law even forbids a local option and prohibits cities and counties from banning the off-premises sale of alcohol.\nQuestion: can you buy wine in grocery stores in missouri?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The return address is not required on postal mail. However, lack of a return address prevents the postal service from being able to return the item if it proves undeliverable; such as from damage, postage due, or invalid destination. Such mail may otherwise become dead letter mail.\nQuestion: do you need to put return address on mail?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: In order to defend herself, Bree asks Bob Hunter for legal advice, but he tells her she needs a crime lawyer. He recommends lawyer Trip Weston, whom he calls a ``shark''. Bree goes to trial but does not tell Trip all the truth, and is about to go to prison until Mrs. McCluskey confesses the murder of Alejandro herself, after Bree and the girls agree to take care of her during her last days of life. Bree is acquitted of all charges. In the end, Bree ends up getting married to Trip and moving to Louisville, Kentucky where she joins a club for conservative women. Later she is encouraged by Trip to run for the city council, then the following November she is elected to the Kentucky Legislature.\nQuestion: does bree van de kamp go to jail?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Both the plaintiff(s) and the defendant(s) also receive an appearance fee. The appearance fee amount has varied as between different litigants of the show: certain litigants have reported receiving a $500 appearance fee while others have reported receiving $100, and others $250. In addition to the appearance fee amount, litigants are paid $35 a day by the show. The litigants' stay lasts for the number of days that the show does taping for that week, which is two or three days. In addition, the airfare (or other means of travel) and hotel expenses of the litigants and their witnesses are covered by the show, and the experience is generally treated as an all-expense-paid vacation outside of the actual court case. If there is an exchange of property, Sheindlin signs an order, and a sheriff or marshal oversees the exchange. Sheindlin sees only a half-page complaint and a defense response prior to the taping of the cases, sometimes only moments before. Most of the cases, not including any footage deleted to meet the time constraints of the show, usually last anywhere from twelve to forty-five minutes.\nQuestion: do you have to pay to be on judge judy?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The State neither issues nor requires a permit to carry a weapon on one's person, openly or concealed. This is known in the U.S. as constitutional carry, since one's ``permit'' is the United States Constitution. Vermont is the only state where this has always been the case (hence the alternative term Vermont carry). Vermont law does not distinguish between residents and non-residents of the state; both have the same right to carry permit-free while in Vermont.\nQuestion: do you need a gun permit in vermont?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The purpose of not counting a sacrifice fly as an at-bat is to avoid penalizing hitters for a successful action. The sacrifice fly is one of two instances in baseball where a batter is not charged with a time at bat after putting a ball in play; the other is the sacrifice hit (also known as a sacrifice bunt). But, while a sacrifice fly doesn't affect a player's batting average, it counts as a plate appearance, thus lowering his on-base percentage, and a player on a hitting streak will have the hit streak end if he has no official at-bats but has a sacrifice fly.\nQuestion: does a sac fly count against your batting average?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Since 22 February 2017, New Hampshire is a constitutional carry state, requiring no license to open carry or concealed carry a firearm in public. Concealed carry permits are still issued for purposes of reciprocity with other states.\nQuestion: do i need a concealed carry permit in nh?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Typically, no license or advanced training beyond just firearm familiarization (for rentals) and range rules familiarization is usually required for using a shooting range in the United States; the only common requirement is that the shooter must be at least 18 or 21 years old (or have a legal guardian present), and must sign a waiver prior to shooting.\nQuestion: do i need a license to shoot at a gun range?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: ``Stop and identify'' statutes are statutory laws in the United States that authorize police to legally obtain the identification of someone whom they reasonably suspect of having committed a crime. If there is no reasonable suspicion that a crime has been committed, is being committed, or is about to be committed, an individual is not required to provide identification, even in ``Stop and ID'' states.\nQuestion: do i need to provide id to police?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The economic problem is most simply explained by the question: ``How do we satisfy unlimited wants with limited resources?'' The premise of the economic problem model is that wants are constant and infinite due to constantly changing demands (often closely related to changing demographics of the population), but resources in the world to satisfy human wants are always limited to the amount of natural or human resources available. The economic problem and methods to curb it--revolve around the idea of choice in prioritizing which wants can be fulfilled and what to produce for the economy.\nQuestion: can there be an economy without economic problem?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: When a traffic stop is made, a warning issued by the officer is a statement that the motorist has committed some offense, but is being spared the actual citation. Officers use their own discretion whether to issue a citation or warning. The motorist may receive the warning either verbally or written, but will not be charged with the offense, will not have to pay a fine, and will not receive any points. Depending on the laws of the jurisdiction, the warning may or may not appear on records visible to officers, which, if it does, could result in another stop within a fixed period of time leading to an actual citation, or in some cases, the motorist may be charged with both offenses.\nQuestion: do you have to pay for a warning ticket?", "output": "no", "options": ["no", "yes"]}
