{"task": "ag_news", "input": "Article: Microsoft Corp. 2.0: a kinder corporate culture Even a genius can mess up. Bill Gates was a brilliant technologist when he cofounded Microsoft , but as he guided it to greatness in both size and historical consequence, he blundered. He terrorized underlings with his temper and parceled out praise like Scrooge gave to charity. Only the lash inspired the necessary aggressiveness to beat the competition, he thought.\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Microsoft Corp. 2.0: a kinder corporate culture Even a genius can mess up. Bill Gates was a brilliant technologist when he cofounded Microsoft , but as he guided it to greatness in both size and historical consequence, he blundered. He terrorized underlings with his temper and parceled out praise like Scrooge gave to charity. Only the lash inspired the necessary aggressiveness to beat the competition, he thought.\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: The Real Time Modern Manila Blues: Bill Monroe Meets Muddy Waters in the Orient Globalization does strange things to people. A day in the life of a Manila Philippines based business consultant - proving that you really CAN talk about Muddy Walters, bluegrass and work all on the same page...\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Motorola Expects Strong Sales Growth  SINGAPORE (Reuters) - Motorola Inc., the world's  second-largest mobile phone maker, said on Tuesday it expects  to sustain strong sales growth in the second half of 2004  thanks to new handsets with innovative designs and features.\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Britain Grants Human Cloning License (AP) AP - Britain granted its first license for human cloning Wednesday, joining South Korea on the leading edge of stem cell research, which is restricted by the Bush administration and which many scientists believe may lead to new treatments for a range of diseases.\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Canadian Robot a Candidate to Save Hubble (AP) AP - NASA said Tuesday it is moving ahead with plans to send a robot to the rescue of the aging Hubble Space Telescope.\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Universities to Build Largest Telescope (AP) AP - The University of Texas and Texas A amp;M University are planning to construct what they call the world's largest telescope with the help of a Houston businessman's  #36;1.25 million gift.\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: 'Madden,' 'ESPN' Football Score in Different Ways  PROVIDENCE, R.I. (Reuters) - Was absenteeism a little high  on Tuesday among the guys at the office? EA Sports would like  to think it was because \"Madden NFL 2005\" came out that day,  and some fans of the football simulation are rabid enough to  take a sick day to play it.\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Microsoft to Introduce Cheaper Version of Windows  SEATTLE (Reuters) - Microsoft Corp. &lt;MSFT.O&gt; said it will  begin selling a stripped-down, low-cost version of its Windows  XP operating system in the emerging markets of Indonesia,  Malaysia and Thailand in order to spread the use of computing  and develop technology markets.\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: A Digital Doctor Treats Computer Contamination Unfortunately for users, computer equipment manufacturers and resellers don't adequately inform Windows users of the risks involved in accessing the Internet without proper security measures.&lt;br&gt;&lt;FONT face=\"verdana,MS Sans Serif,arial,helvetica\" size=\"-2\"\\ color=\"#666666\"&gt;&lt;B&gt;-The Washington Post&lt;/b&gt;&lt;/font&gt;\nAnswer:", "output": "Technology", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: EBay Buys Stake in Craigslist Internet auctioneer eBay Inc. said Friday it acquired a 25 percent stake in craigslist, an online community of classified ads and forums. &lt;FONT face=\"verdana,MS Sans Serif,arial,helvetica\" size=\"-2\"\\ color=\"#666666\"&gt;&lt;B&gt;-Associated Press&lt;/B&gt;&lt;/FONT&gt;\nAnswer:", "output": "Business", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: How Mars Fooled the World The famous Orson Welles' radio broadcast of \"The War of the Worlds\" is about to hit the big screen, as film moguls Spielberg and Cruise bring the H.G. Wells' classic back into the popular imagination. Are we so clever today not be duped?\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: US NBA players become the Nightmare Team after epic loss (AFP) AFP - Call them the \"Nightmare Team\".\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Players Union Challenges Carter's Release (AP) AP - The NFL Players Association has gotten involved in Quincy Carter's release by the Dallas Cowboys.\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Greeks get surprise gold in synchronized diving It was a glorious surprise, igniting a party complete with song and dance: The Greeks won the first gold medal of their hometown Olympics with an unexpected victory last night in synchronized diving.\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Iranian judo scandal Iran #39;s Judo champion, a favourite at the Athens Games, has disqualified himself rather than face an Israeli opponent, apparently on the instruction of Iran #39;s Olympic Committee. So far the International Olympic Committee has been silent. What #39;s your view? ...\nAnswer:", "output": "Sports", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: NATO proclaims victory in Bosnia SARAJEVO, Bosnia-Herzegovina -- When NATO forces first came to Bosnia nearly a decade ago, they lived in heavily guarded compounds, patrolled the streets in tanks, and often wore full body armor.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Mortars Mark Opening of Iraqi Political Conference (Reuters) Reuters - Insurgents fired mortars at a meeting\\where Iraqi leaders met to pick an interim national assembly\\Sunday, killing at least two people in a grim reminder of the\\country's tortuous path toward democracy.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: France marks the 'other D-Day' Two days of celebrations to honour the Allied veterans who liberated southern France near a climax.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
{"task": "ag_news", "input": "Article: Iraqi Conference on Election Plan Sinks Into Chaos The conference was thrown into disorder by delegates staging protests against the U.S.-led military operation in Najaf.\nAnswer:", "output": "World", "options": ["World", "Sports", "Business", "Technology"]}
