{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Take Your Dog to Work Day (TYDTWDay) was created by Pet Sitters International and first celebrated in 1999. PSI created the day to encourage businesses to allow dogs in the workplace for one Friday each year to celebrate the great companions dogs make and promote their adoptions from local shelters, rescue groups and humane societies. PSI believes that through the event dog-less co-workers will be encouraged to adopt when they witness the human-animal bond. The week leading up to Take Your Dog To Work Day is Take Your Pet To Work Week. Take Your Dog to Work Day and Take Your Pet to Work Week are registered trademarks of Pet Sitters International, Inc.\nQuestion: is there a national bring your dog to work day?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Since their inception in 1995, the Raptors have made the playoffs ten times (2000--2002, 2007, 2008, and 2014--2018, all inclusive), advancing past the first round four times (2001 and 2016--2018). The Raptors have won the Atlantic Division five times (2007, 2014--2016, and 2018), and the franchise record number of wins in the regular season is 59 (2018). The Raptors advanced to the Eastern Conference Finals only once (2016). Five Raptors have been selected to play in the All-Star game: Vince Carter, Antonio Davis, Chris Bosh, DeMar DeRozan and Kyle Lowry.\nQuestion: have the raptors ever made it to the finals?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The drinking age in Wisconsin is 21. Those under the legal drinking age may be served, possess, or consume alcohol if they are with a parent, legal guardian, or spouse who is of legal drinking age. Those age 18 to 20 may also possess (but not consume) alcohol as part of their employment.\nQuestion: can you drink when your 18 with your parents in wisconsin?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Missouri has no specific state limitations on the places where alcohol may be sold ``off-premises'' (i.e. for consumption elsewhere). As a result, Missouri is famous in the region for grocery stores, drug stores, and even gas stations throughout the state which sell a wide variety of beer, wine, and liquor. As long as it is not located within 100 feet (30 m) of a school or church, virtually any retail business (including a vague and undefined ``general merchandise store'') which obtains the proper licenses from the Division of Alcohol and Tobacco Control and local authorities may sell any type of alcohol. State law even forbids a local option and prohibits cities and counties from banning the off-premises sale of alcohol.\nQuestion: can you buy wine in grocery stores in missouri?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Epsom railway station serves the town of Epsom in Surrey. It is located off Waterloo Road and is less than two minutes' walk from the High Street. It is not in the London Oyster card zone unlike Epsom Downs or Tattenham Corner stations. The station building was replaced in 2012/2013 with a new building with apartments above the station (see end of article).\nQuestion: can you use oyster card at epsom station?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The NBA high school draftees are players who have been drafted to the National Basketball Association (NBA) straight out of high school without playing basketball at the collegiate level. The process of jumping directly from high school to the professional level is also known as going prep-to-pro. Since 2006, the practice of drafting high school players has been prohibited by the new collective bargaining agreement, which requires that players who entered the draft be 19 years of age and at least one year removed from high school. Contrary to popular belief, the player does not have to play at least a year in college basketball, as the player can choose to instead play in another professional league (like the NBA G League or especially somewhere overseas) like Brandon Jennings or Emmanuel Mudiay in Italy and China respectively, simply take the year off, such as the case with Mitchell Robinson, or even hold themselves back a year in high school before declaring for the draft, like with Satnam Singh Bhamara or Thon Maker.\nQuestion: can you get drafted out of high school into the nba?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The VIC differs from a Veteran Health Identification Card (VHIC) or a DoD Uniformed Services or retiree ID Card as it cannot be used as proof of eligibility for any federal benefits and does not grant access to military installations.\nQuestion: can i use my veteran id to get on base?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: On May 10, 2013, Rules of Engagement was cancelled by CBS after seven seasons and 100 episodes. The series finale episode aired on May 20, 2013.\nQuestion: is there going to be a season 8 of rules of engagement?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Monozygotic twins are genetically nearly identical and they are always the same sex unless there has been a mutation during development. The children of monozygotic twins test genetically as half-siblings (or full siblings, if a pair of monozygotic twins reproduces with another pair or with the same person), rather than first cousins. Identical twins do not have the same fingerprints however, because even within the confines of the womb, the fetuses touch different parts of their environment, giving rise to small variations in their corresponding prints and thus making them unique.\nQuestion: can you have identical twins that are different genders?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The State neither issues nor requires a permit to carry a weapon on one's person, openly or concealed. This is known in the U.S. as constitutional carry, since one's ``permit'' is the United States Constitution. Vermont is the only state where this has always been the case (hence the alternative term Vermont carry). Vermont law does not distinguish between residents and non-residents of the state; both have the same right to carry permit-free while in Vermont.\nQuestion: do you need a gun permit in vermont?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The purpose of not counting a sacrifice fly as an at-bat is to avoid penalizing hitters for a successful action. The sacrifice fly is one of two instances in baseball where a batter is not charged with a time at bat after putting a ball in play; the other is the sacrifice hit (also known as a sacrifice bunt). But, while a sacrifice fly doesn't affect a player's batting average, it counts as a plate appearance, thus lowering his on-base percentage, and a player on a hitting streak will have the hit streak end if he has no official at-bats but has a sacrifice fly.\nQuestion: does a sac fly count against your batting average?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The Dominican Republic (Spanish: República Dominicana (reˈpuβliˌka ðoˌminiˈkana)) is a sovereign state located in the island of Hispaniola, in the Greater Antilles archipelago of the Caribbean region. It occupies the eastern five-eighths of the island, which it shares with the nation of Haiti, making Hispaniola one of two Caribbean islands, along with Saint Martin, that are shared by two countries. The Dominican Republic is the second-largest Caribbean nation by area (after Cuba) at 48,445 square kilometers (18,705 sq mi), and third by population with approximately 10 million people, of which approximately three million live in the metropolitan area of Santo Domingo, the capital city.\nQuestion: is the domincan republic part of the usa?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Since 22 February 2017, New Hampshire is a constitutional carry state, requiring no license to open carry or concealed carry a firearm in public. Concealed carry permits are still issued for purposes of reciprocity with other states.\nQuestion: do i need a concealed carry permit in nh?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: ``Stop and identify'' statutes are statutory laws in the United States that authorize police to legally obtain the identification of someone whom they reasonably suspect of having committed a crime. If there is no reasonable suspicion that a crime has been committed, is being committed, or is about to be committed, an individual is not required to provide identification, even in ``Stop and ID'' states.\nQuestion: do i need to provide id to police?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: When a traffic stop is made, a warning issued by the officer is a statement that the motorist has committed some offense, but is being spared the actual citation. Officers use their own discretion whether to issue a citation or warning. The motorist may receive the warning either verbally or written, but will not be charged with the offense, will not have to pay a fine, and will not receive any points. Depending on the laws of the jurisdiction, the warning may or may not appear on records visible to officers, which, if it does, could result in another stop within a fixed period of time leading to an actual citation, or in some cases, the motorist may be charged with both offenses.\nQuestion: do you have to pay for a warning ticket?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: The signing of the Residence Act on July 16, 1790, approved the creation of a capital district located along the Potomac River on the country's East Coast. The U.S. Constitution provided for a federal district under the exclusive jurisdiction of the Congress and the District is therefore not a part of any state. The states of Maryland and Virginia each donated land to form the federal district, which included the pre-existing settlements of Georgetown and Alexandria. Named in honor of President George Washington, the City of Washington was founded in 1791 to serve as the new national capital. In 1846, Congress returned the land originally ceded by Virginia; in 1871, it created a single municipal government for the remaining portion of the District.\nQuestion: is washington dc a state in the united states?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Broadway Junction is a New York City Subway station complex shared by the elevated BMT Canarsie Line and BMT Jamaica Line, and the underground IND Fulton Street Line. It was also served by trains of the Fulton Street Elevated until that line closed in 1956. It is located roughly at the intersection of Broadway, Fulton Street and Van Sinderen Avenue at the border of Bedford-Stuyvesant and East New York, Brooklyn. The complex is served by the A, J, and L trains at all times; the C train at all times except late nights; and the Z train during rush hours in the peak direction only.\nQuestion: does the m train go to broadway junction?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: After sharing a romantic dance with the Beast, Belle discovers her father's predicament using a magic mirror. The Beast releases her to save Maurice, giving her the mirror to remember him with. At Villeneuve, Belle reveals the Beast in the mirror to the townsfolk, proving her father's sanity. Realizing that Belle loves the Beast, a jealous Gaston claims she has been charmed by dark magic, and has her thrown into the asylum carriage with her father. He rallies the villagers to follow him to the castle to slay the Beast before he curses the whole village. Maurice and Belle escape, and Belle rushes back to the castle.\nQuestion: does maurice die in beauty and the beast?", "output": "no", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: Both Jersey and Bank of England notes are legal tender in Jersey and circulate together, alongside the Guernsey pound and Scottish banknotes. The Jersey notes are not legal tender in the United Kingdom but are legal currency, so creditors and traders may accept them if they so choose.\nQuestion: is jersey money legal tender in the uk?", "output": "yes", "options": ["no", "yes"]}
{"task": "boolq", "input": "Exercise: read the text and answer the question by yes or no.\n\nText: During any given major league game, both the home and visiting team batboys will be drawn from the city where the game is taking place (batboys typically do not travel on the road with their team, unless they are relatives of a player). Home batboys often have regular jobs with a team, and thus may wear their first names on their uniforms; visiting teams, on the other hand, usually do not know who will be serving as their batboys on the road, and thus will send uniforms of various sizes to accommodate batboys of varying heights and weights.\nQuestion: does the bat boy travel with the team?", "output": "yes", "options": ["no", "yes"]}
